# Indexing and editing of a Series data

In [3]:
import pandas as pd

In [4]:
l_1 = [30,31,32]
idx = ["a","b","c"]
s_1 = pd.Series(data=l_1,index=idx)
s_1

a    30
b    31
c    32
dtype: int64

In [5]:
s_1[1]

31

In [6]:
s_1[0:2]

a    30
b    31
dtype: int64

In [7]:
s_1.loc["a"]

30

In [8]:
s_1.iloc[1]

31

In [9]:
s_2 = s_1.copy()
s_2["c"] = 90
s_2

a    30
b    31
c    90
dtype: int64

In [10]:
s_2.replace(to_replace=90, value=88, inplace=True)

In [11]:
s_2

a    30
b    31
c    88
dtype: int64

In [12]:
s_2.index

Index(['a', 'b', 'c'], dtype='object')

In [13]:
s_2.index = ["a","b","z"]
s_2

a    30
b    31
z    88
dtype: int64

In [14]:
s_2.rename(index={"a":"y"}, inplace=True)
s_2

y    30
b    31
z    88
dtype: int64

In [15]:
s_3 = pd.Series([71,131], index=["x1","x2"])
s_3

x1     71
x2    131
dtype: int64

In [16]:
s_2 = s_2.append(s_3)
s_2

y      30
b      31
z      88
x1     71
x2    131
dtype: int64

In [17]:
s_2["x3"] = 99
s_2

y      30
b      31
z      88
x1     71
x2    131
x3     99
dtype: int64

In [18]:
s_2.append(s_3, ignore_index=False)

y      30
b      31
z      88
x1     71
x2    131
x3     99
x1     71
x2    131
dtype: int64

In [19]:
s_2.append(s_3, ignore_index=True)

0     30
1     31
2     88
3     71
4    131
5     99
6     71
7    131
dtype: int64

In [20]:
s_3

x1     71
x2    131
dtype: int64

In [21]:
del s_3["x1"]
s_3

x2    131
dtype: int64

In [22]:
s_3.drop(["x2"], inplace=True)
s_3

Series([], dtype: int64)

In [23]:
s_3

Series([], dtype: int64)

# Indexing, editing and deletion of a DataFrame

In [24]:
l_1 = [[1,2,3],[4,5,6]]
idx = ["a","b"]
col = ["x1","x2","x3"]
data_1 = pd.DataFrame(data=l_1, index=idx, columns=col)
data_1

   x1  x2  x3
a   1   2   3
b   4   5   6

In [25]:
data_1["x1"]

a    1
b    4
Name: x1, dtype: int64

In [26]:
data_1.iloc[0]

x1    1
x2    2
x3    3
Name: a, dtype: int64

In [27]:
data_1.loc["a"]

x1    1
x2    2
x3    3
Name: a, dtype: int64

In [28]:
data_1.loc["a"]["x1"] = 99
data_1

   x1  x2  x3
a  99   2   3
b   4   5   6

In [29]:
data_1.index = ["c","b"]
data_1

   x1  x2  x3
c  99   2   3
b   4   5   6

In [30]:
data_1.loc["e"] = [10,11,12]
data_1

   x1  x2  x3
c  99   2   3
b   4   5   6
e  10  11  12

In [31]:
l_1 = [[1,2,3],[4,5,6]]
idx = ["j","k"]
col = ["x1","x2","x3"]
data_2 = pd.DataFrame(data=l_1, index=idx, columns=col)
data_2

   x1  x2  x3
j   1   2   3
k   4   5   6

In [32]:
data_3 = pd.concat([data_1,data_2])
data_3

   x1  x2  x3
c  99   2   3
b   4   5   6
e  10  11  12
j   1   2   3
k   4   5   6

In [34]:
data_3 = pd.concat([data_1,data_2], axis=0)
data_3

   x1  x2  x3
c  99   2   3
b   4   5   6
e  10  11  12
j   1   2   3
k   4   5   6

In [35]:
data_2["z4"] = [32,42]
data_2

   x1  x2  x3  z4
j   1   2   3  32
k   4   5   6  42

In [36]:
data_4 = pd.DataFrame([[10,11],[12,12]], index=["k","j"], columns=["y5","y6"])
data_4

   y5  y6
k  10  11
j  12  12

In [37]:
data_5 = pd.concat([data_2,data_4], axis=1)
data_5

   x1  x2  x3  z4  y5  y6
j   1   2   3  32  12  12
k   4   5   6  42  10  11

In [38]:
data_5.drop(["j"], axis=0, inplace=True)
data_5

   x1  x2  x3  z4  y5  y6
k   4   5   6  42  10  11

In [39]:
del data_5["z4"]
data_5

   x1  x2  x3  y5  y6
k   4   5   6  10  11

In [40]:
data_5.drop(["x1","x2","x3"], axis=1, inplace=True)
data_5

   y5  y6
k  10  11

# Merge in DataFrame

In [41]:
left = pd.DataFrame({"key":["K0","K1","K2","K3"],
                    "A":["A0","A1","A2","A3"],
                    "B":["B0","B1","B2","B3"]})

right = pd.DataFrame({"key":["K0","K1","K2","K3"],
                    "C":["C0","C1","C2","C3"],
                    "D":["D0","D1","D2","D3"]})

In [42]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [43]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [44]:
pd.merge(left,right)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [45]:
pd.merge(left,right,on="key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

# Display options in Pandas

In [50]:
pd.get_option("display.max_rows")

60

In [51]:
pd.Series(index=range(0,80))

<ipython-input-51-39322ad8ecae>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd.Series(index=range(0,80))

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
      ..
75   NaN
76   NaN
77   NaN
78   NaN
79   NaN
Length: 80, dtype: float64

In [52]:
pd.set_option("display.max_rows",6)

In [53]:
pd.Series(index=range(0,80))

<ipython-input-53-39322ad8ecae>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd.Series(index=range(0,80))

0    NaN
1    NaN
2    NaN
      ..
77   NaN
78   NaN
79   NaN
Length: 80, dtype: float64

In [54]:
pd.get_option("display.max_columns")

20

In [55]:
pd.DataFrame(columns = range(0,30))

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29]
Index: []

[0 rows x 30 columns]

In [56]:
pd.set_option("display.max_columns",30)

In [57]:
pd.get_option("display.max_colwidth")

50

In [58]:
pd.Series(index=["A"], data=["t"*80])

A    tttttttttttttttttttttttttttttttttttttttttttttt...
dtype: object

In [59]:
pd.set_option("display.max_colwidth",100)

In [60]:
pd.get_option("display.precision")

6

In [61]:
pd.set_option("display.precision",20)
pd.Series(data=[1.23456789107786545])

0    1.23456789107786546467
dtype: float64